{
    "authors": "",
    "date_download": "2023-05-01 19:29:39",
    "date_modify": "2023-05-01 19:29:39",
    "date_publish": "2022-03-10 13:03:00",
    "description": "Hispasat, the Spanish satellite solutions provider, is partnering with NAGRA, an independent content solutions provider, to develop a wholesale OTT (over-the-top) television solution.",
    "filename": "article_29texrfzy71zzezbgfq_b87a12f77bfd9dc4bbdaf503af0b81aa_hispasat-and-nagra-to-launch-wholesale-latam-ott-service_0000017e-d53c-d5a5-af7f-fdbd90bb0000-page=4_1682969379.html",
    "image_url": "https://assets.euromoneydigital.com/dims4/default/d8f178f/2147483647/strip/true/crop/995x522+0+37/resize/1200x630!/quality/90/?url=http%3A%2F%2Feuromoney-brightspot.s3.amazonaws.com%2F54%2Ff8%2Ff799b0df4250bdb5f47afc168f16%2Fsatelitte-tv-16.9.jpg",
    "language": "en",
    "maintext": "Due to launch in Spring of 2022, both companies are offering an early demonstration of this new content solution for interested clients. Once live the service will enable pay-TV operators, Internet service providers and regional content companies to offer their clients a high-quality multiscreen entertainment service that is distributed using the Internet without having to roll out their own infrastructure.\n“This agreement opens a new branch in our offer as a wholesale video service provider, which was consolidated at the start of last year with the acquisition of the of the video signal transport and management business of Media Networks Latin America, and strengthens our leading position in the region,\" said Javier Izquierdo, managing director of Hispasat Perú.\n\"Thanks to this agreement with NAGRA, we will complement our satellite services with a product that provides a solid response to the growing demand for linear streaming and Internet on-demand solutions in the region.”\nUnder the terms of the collaboration, Hispasat will provide the video processing infrastructure at its teleport in Lurin, Peru, as well as recieve linear content (TV channels) and on-demand content, and its coding and publication.\nThis will be powered by the NAGRA OpenTV Video Platform and Harmonic’s VOS 360 cloud streaming solution, enabling Hispasat customers to promote, curate, and monetise their content.\n“This new wholesale service will allow HISPASAT customers to include a new OTT service as part of their existing offer that optimizes roll-out costs, time-to-market and is adaptable to their specific needs,\" added Nancy Goldberg, EVP and chief marketing & sales officer at NAGRA.\n\"We’re delighted to empower HISPASAT to deliver additional value to regional service providers in Latin America and enable them, through a fully-featured solution, to aggregate content, drive consumer engagement and accelerate digital transformation through which they can address new audiences.”\nUsing additional tools for content aggregation, offer management, bundling and pricing, content management and app layout visualisation, the NAGRA solution will also include content security capabilities such as multi-DRM (digital rights management).\nLeveraging its UX framework, NAGRA will also be responsible for developing user applications for set-top box and streaming devices, including smart TVs personalized for operators. HISPASAT will be responsible for the operation of the service from the teleport of Lurin, Peru.",
    "source_domain": "capacitymedia.com",
    "title": "Hispasat and NAGRA to launch wholesale Latam OTT service",
    "title_page": "Hispasat and NAGRA to launch wholesale Latam OTT service | Capacity Media",
    "title_rss": "NULL",
    "url": "https://www.capacitymedia.com/article/29texrfzy71zzezbgfqio/infrastructure-and-network/satellite/hispasat-and-nagra-to-launch-wholesale-latam-ott-service?0000017e-d53c-d5a5-af7f-fdbd90bb0000-page=4"
}